[{"id":"21111","image":"image-1603152244212.jpg","name":"React Native: Crea aplicaciones móviles reales iOS y Android","shortDescription":"Aprende a crear aplicaciones iOS y Android con React Native, React Navigation 5, Firebase, RealTime, Strapi, Hooks y más","description":"Gracias a este curso aprenderás desde los conceptos básicos de React Native, hasta lo más avanzados para crear cualquier tipo de APP completa desde cero.\r\n\r\nUna vez terminado el curso serás capaz de crear cualquier tipo de aplicación móvil conectada a una base de datos sin necesidad de ayuda.","category":"Programacion front-end","price":"2000","discount":"15","link":"https://www.udemy.com/course/react-native-crea-aplicaciones-moviles-reales-ios-y-android/"},{"id":"2111","image":"image-1603152169670.jpg","name":"Angular Avanzado: Lleva tus bases al siguiente nivel - MEAN","shortDescription":"MEAN, Google Signin, JWT, carga de archivos, lazyload, optimizaciones, Git, GitHub, panel administrativo y mucho más.","description":"Este curso tiene por objetivo tomar tu conocimiento de Angular (Angular 2,4,5,6,7,8,9 o 10), y llevarlo al siguiente nivel creando una gran aplicación modular de gran escala.   \r\n\r\n El curso no pretende enseñarte las bases de Angular, ya que doy por hecho que sabes cómo programar utilizando el framework, al menos saber cómo utilizar servicios, componentes básicos, ciclo de vida de un componente y rutas, todo lo demás lo enseñaremos aquí.\r\n\r\n Este curso es totalmente práctico, aprenderemos haciendo una aplicación completa desde cero, que va desde el Front-End hasta el Backend, trabajando con MongoDB, JWT y Google SignIn.","category":"Programacion front-end","price":"1600","discount":"10","link":"https://www.udemy.com/course/angular-avanzado-fernando-herrera/"},{"id":"21","image":"image-1603151775558.jpg","name":"Node: De cero a experto","shortDescription":"Rest, despliegues, heroku, mlab, git, github, sockets, subida de archivos, jwt y mucho más para ser un experto en Node!","description":"¿Qué es Node?\r\n\r\nEs muy posible que si llegaste al curso es porque alguien te mencionó sobre Node, alguien lo usa o bien tienes curiosidad de lo que Node puede hacer... aquí aprenderemos muchas cosas que te explicarán porque Node están popular hoy en día.\r\n\r\n¿Interesado en aprender Node? \r\n\r\nTe encuentras en el lugar correcto, no importa si tu conocimiento de Node es cero y si ya tienes una base muy fuerte de Node. Este curso parte de nada y termina con una base sumamente sólida para que puedas crear aplicaciones de todo tipo utilizando Node. \r\n\r\nObjetivo del curso:\r\n\r\nMi objetivo con este curso, es enseñar Node con ejercicios reales y aplicables en la vida real, aprender haciendo aplicaciones, incrementando la complejidad de las mismas poco a poco, y sin darte cuenta estaremos trabajando con bases de datos, sockets, consumiendo servicios y mucho más.","category":"Programacion back-end","price":"1800","discount":"10","link":"https://www.udemy.com/course/node-de-cero-a-experto/"},{"id":"211","image":"image-1603152093661.jpg","name":"Master Flutter & Dart: De cero a experto","shortDescription":"Desarrolla aplicaciones IOS y Android desde un solo lugar con Flutter y Dart. +13 Aplicaciones y 2 Proyectos Reales","description":"Flutter es el nuevo framework mobile de Google para crear interfaces nativas en iOS y Android en un tiempo récord. Flutter funciona con Dart (originalmente llamado Dash) el cual es un lenguaje de programación orientado a objetos y de código abierto. La prioridad de Flutter es aumentar la calidad de desarrollo de aplicaciones y que sea sencillo.\r\n\r\n¿Porque deberíamos comenzar a utilizar Flutter?\r\n\r\nMultiplataforma:\r\n\r\nAl utilizar el mismo render, framework y librerías, flutter permite crear a través de un solo UI una aplicación que pueda correr tanto en Android como en IOS, además proporciona widgets basados en las pautas de Cupertino (IOS) y Material Design (Android) como los es el scrolling, navegación, iconos y fuentes para proporcionar un completo rendimiento nativo en el dispositivo\r\n\r\nDesarrollo Rápido:\r\n\r\nHot Reload es una práctica que permite realizar cambios en tu aplicación en tiempos de ejecución. En milisegundos las modificaciones se verán en el dispositivo sin la necesidad de tener que detener y levantar la aplicación como se realiza en el modo tradicional.\r\n\r\nComunidad en crecimiento\r\n\r\nFlutter es un framework aún en Beta, pero está respaldado por Google, su comunidad va en crecimiento, lo cual queda demostrado en su github oficial.","category":"Programacion back-end","price":"1500","discount":"5","link":"https://www.udemy.com/course/master-flutter-dart-de-cero-a-experto/"}]