[{"id":"211","image":"image-1603152093661.jpg","name":"Master Flutter & Dart: De cero a experto","shortDescription":"Desarrolla aplicaciones IOS y Android desde un solo lugar con Flutter y Dart. +13 Aplicaciones y 2 Proyectos Reales","description":"Flutter es el nuevo framework mobile de Google para crear interfaces nativas en iOS y Android en un tiempo récord. Flutter funciona con Dart (originalmente llamado Dash) el cual es un lenguaje de programación orientado a objetos y de código abierto. La prioridad de Flutter es aumentar la calidad de desarrollo de aplicaciones y que sea sencillo.\r\n\r\n¿Porque deberíamos comenzar a utilizar Flutter?\r\n\r\nMultiplataforma:\r\n\r\nAl utilizar el mismo render, framework y librerías, flutter permite crear a través de un solo UI una aplicación que pueda correr tanto en Android como en IOS, además proporciona widgets basados en las pautas de Cupertino (IOS) y Material Design (Android) como los es el scrolling, navegación, iconos y fuentes para proporcionar un completo rendimiento nativo en el dispositivo\r\n\r\nDesarrollo Rápido:\r\n\r\nHot Reload es una práctica que permite realizar cambios en tu aplicación en tiempos de ejecución. En milisegundos las modificaciones se verán en el dispositivo sin la necesidad de tener que detener y levantar la aplicación como se realiza en el modo tradicional.\r\n\r\nComunidad en crecimiento\r\n\r\nFlutter es un framework aún en Beta, pero está respaldado por Google, su comunidad va en crecimiento, lo cual queda demostrado en su github oficial.","category":"Programacion back-end","price":"1500","discount":"5","link":"https://www.udemy.com/course/master-flutter-dart-de-cero-a-experto/"},{"id":"211111","image":"image-1603152550599.jpg","name":"Tablas Dinámicas: Análisis de datos en Microsoft Excel. BETA","shortDescription":"Domina las Tablas Dinámicas. Aprende la herramienta más potente de Excel para obtener estadísticas sin crear fórmulas.","description":"Si de algo puede presumir Excel, es de su capacidad para obtener estadísticas, resultados matemáticos y seguro que en lo primero que has pensado es, en sus fórmulas, más en concreto en las funciones que podemos usar dentro de esas fórmulas. Pero que pensarías si te digo que no son la herramienta más potente que tiene Excel para realizar ese tipo de trabajos, que hay otra. Y, además esa herramienta permite obtener los resultados sin crear fórmulas, sin escribir una sola fórmula de Excel, simplemente haciendo clics con el ratón... Bueno pues no estoy loco ni te estoy engañando, esa herramienta son las Tablas Dinámicas.\r\n\r\nSon la herramienta más potente de análisis de datos y el camino fácil sería deciros que sirven para obtener estadísticas, pero la realidad es que son algo más que eso. Con las Tablas Dinámicas, Excel pone en vuestras manos una herramienta capaz de analizar millones de filas de datos, para obtener resultados individuales o tablas comparativas con diferentes datos o criterios. Son la herramienta definitiva para convertir tus datos en información, en respuestas, en estadísticas con las que tomar decisiones o detectar las razones del porqué de esos resultados.","category":"Negocios, inversiones, trading","price":"1200","discount":"0","link":"https://www.udemy.com/course/tablas-dinamicas-microsoft-excel/"}]